/* 
    标题
// 1
// 梦三国2
// 龙之谷
// 真三国无双Online
// 剑网3
// 海战世界
// 古剑奇谭网络版
// 坦克世界
// 元能失控
// 奇奥英雄传
// 打造世界
// 风暴岛
// 群雄逐鹿HD

// 2
// 剑灵洪门崛起
// 暖暖村物语
// 月圆之夜（经典版）
// 无名之辈
// 孤山堡垒
// 月圆之夜
// 九霄缳神记
// 计划通
// 怪兽联盟
// 传送门骑士（合辑版）
// 椰岛合辑包
// 洪潮之焰

*/


/* 

上线时间


2020-01-09 上线
2019-10-24 上线
2019-09-24 上线
2019-06-20 上线
2019-10-25 上线
2019-07-08 上线
2019-07-23 正式登陆
2020-04-21 上线
2020-04-23 不删档付费测试
2019-07-12 上线
2020-04-01 上线
2019-09-25 公测开启


推荐率
69.6%

推荐率
81.9%

推荐率
70.4%

推荐率
63.5%

推荐率
96.1%

推荐率
84.6%

推荐率
81.0%



["MMORPG",  "moba",    "电子竞技",    "三国",]
["动作冒险",    "爽快手感",    "多人联机",    "Q版画风",]
["三国经典",    "回归动作",    "爽快手感",]
["MMORPG",  "武侠",  "唯美画面",  "剧情丰富",]
["航海",    "电子竞技",    "即时战略",    "二战",]
["MMORPG",  "古代仙侠",  "角色扮演",  "中国文化",]
["射击",    "多人联机",    "军事题材",    "二战",]
["独立游戏",    "Roguelike",   "冒险",   "多人联机",]
["纸牌休闲",    "游戏",    "Q版画风", "手绘画风",]
["沙盒游戏",    "休闲游戏",    "模拟经营",    "策略",]
["生存社交",    "独立游戏",    "角色扮演",]
["免费moba",    "爽快手感",    "经典回归",]
*/