// 10、利用JavaScript，使用循环语句输出如下菱形图案（由“-”和“*”这两种符号组成）


// _ _ _ *
// _ _ * * *
// _ * * * * *
//  * * * * * *
// _ * * * * *
// _ _ * * *
// _ _ _ *

//打印上半部分
for (var o = 1; o <= 4; o++) {

    var str = '';
    for (var i = 1; i <= 4 - o; i++)//i控制_的行打印个数，根据规律_是递减的
    {
        str += "_ ";
    }

    for (var j = 1; j <= o * 2 - 1; j++)//j控制星星的行打印个数，根据规律*是递增的，递增规律是1、3、5、7
    {
        str += "* ";
    }
    console.log(str);
}


for(var h=1;h<=3;h++)
{
    var str = '';
    for (var i = 1; i <= h ; i++)//i控制_的行打印个数，根据规律_是递增的
    {
        str += "_ ";
    }

    for (var j = 1; j <= 7-h*2 ; j++)//j控制星星的行打印个数，根据规律*是递减的，递减规律是1、3、5、7
    {
        str += "* ";
    }
    console.log(str);
}