// 需求:

//    *
//   ***
//  *****
// *******
//  *****
//   ***
//    *

// 分析：*的个数是1、3、5、7、5、3、1
// *前的空格是3、2、1、0、1、2、3






//定义每行输出内容
var c;
//循环控制递减递增行数4
for (var i = 1; i <= 4; i++) {
  //定义控制"-"数
  var a = '' //" "数
  //定义控制*号
  var b = '' //"*"号
  //循环控制每行   数
  for (var x = 1; x <= 4 - i; x++) {
    a = a + ' '
  }
  //循环控制每行 * 数
  for (var y = 1; y <= 2 * i - 1; y++) {
    b = b + '*'
  }
  //定义输出每行内容
  c = a + b
  console.log(c);

}
//循环控制递增递减行数3
for (var i = 3; i >= 1; i--) {
  //定义控制"-"数
  var a = '' //" "数
  //定义控制*号
  var b = '' //"*"号
  //循环控制每行   数
  for (var x = 4 - i; x >= 1; x--) {
    a = a + ' '
  }
  //循环控制每行 * 数
  for (var y = 2 * i - 1; y >= 1; y--) {
    b = b + '*'
  }
  //定义输出每行内容
  c = a + b
  console.log(c);
}


//以下是自己的思考

// //控制前3行
// for (var j = 1; j < 7; j += 2) {
//     var str2 = "";
//     for (var i = 0; i < j; i++) {
//         str2 += "*";
//     }
//     console.log(str2);
// }
// //控制后4行
// for (var j = 7; j > 0; j -= 2) {
//     var str = "";
//     for (var i = 0; i < j; i++) {
//         str += "*";
//     }
//     console.log(str);
// }



/*  空格递减
for(var g=3;g>0;g--)
{
var str3="";
for(var h=0;h<g;h++)
{
    str3+="*";
}
console.log(str3);
}
 */