// 一、编程题
// 30.	 求200到300之间所有奇数的和

// var sum=0;
// for(var i=200;i<=300;i++)
// {
//     if(i%2==1)
//     {
//         sum+=i
//     }
// }
// console.log(sum);

// 31.	 for循环嵌套打印5行5列的正方形，如图所示(拔高题)

// for(var i=1; i<=5; i++)//行数控制
// {
//     var str = '';
//     for(var j=1; j<=5; j++)//列数控制
//     {
//       str += '*';
//     }
//     console.log(str);
//   }
 
// 32.	for循环嵌套打印一个直角三角形,如果所示(拔高题)
/*      * 
        ** 
        *** 
        **** 
        ***** 
*/

// for(var i=1;i<=5;i++)
// {
//     sum=""
//     for(var j=1;j<=i;j++)
//     {
//         sum+="*";
//     }
//     console.log(sum)
// }



// 33.	for循环嵌套打印一个倒的直角三角形,如果所示(拔高题)

/* 
        ****
        ***
        **
        *

 */

//转033.html



 
// 34.	企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
// 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
// 20万到40万之间时，高于20万元的部分，可提成5%；
// 40万到60万之间时高于40万元的部分，可提成3%；
// 60万到100万之间时，高于60万元的部分，可提成1.5%，
// 高于100万元时，超过100万元的部分按1%提成，用户定义变量，输入当月利润I，求应发放奖金总数？


// var i=2000000;
// if(i<=100000)
// {
//     console.log("你的奖金是:",i*0.1,"元")
// }
// else if(i>100000 && i<=200000)
// {
//     console.log("你的奖金是:",10000+(i-100000)*0.075,"元")
// }
// else if(i>200000 && i<=400000)
// {
//     console.log("你的奖金是:",17500+(i-200000)*0.05,"元")
// }
// else if(i>400000 && i<=600000)
// {
//     console.log("你的奖金是:",27500+(i-400000)*0.03,"元")
// }
// else if(i>600000 && i<=1000000)
// {
//     console.log("你的奖金是:",33500+(i-400000)*0.015,"元")
// }
// else if(i>1000000)
// {
//     console.log("你的奖金是:",42500+(i-1000000)*0.01,"元")
// }


// 35.	找出1-99之间是7的倍数或者个位数字是7或者是十位数字是7的数字，在控制台打印输出

    // for(var i=1;i<=99;i++)
    // {
    //     ge=i%10;
    //     shi=parseInt(i/10)
    //     if(i%7==0 || ge==7 || shi==7)
    //     {
    //         console.log(i)
    //     }
    // }

// 36.	利用JavaScript编写程序实现如下功能，五个小朋友排成一队。
// 问第一个多大了，第一个说比第二个大两岁，
//   问第二个，第二个说比第三个大两岁，以此类推。
//   问第五个小朋友几岁了，第五个小朋友说3岁了。
//   问第一个小朋友几岁了？
// 要求：控制台输出第一个小朋友的年龄是几岁

            // 13    11    9    7    5    3
            // var n=3;
            // for(i=1;i<=5;i++)
            // {
            //     n+=2
            // }
            // console.log(n)

// 38.使用for循环语句计算3+6+9+12+……+99的结果


// var sum=0;
//     for(var i=1;i<=99;i++)
//     {
//         if(i%3==0)
//         {
//             sum+=i;
//         }
//     }
//     console.log(sum)



// 39.输出1加到100（去掉3的倍数）的和
// var sum=0;
// for(var i=1;i<=100;i++)
// {
//     if(i%3!=0)
//     {
//         sum+=i;
//     }
// }
// console.log(sum)

// 40.求1-100之间所有数的积

    // var sum=1;
    // for(var i=1;i<=100;i++)
    // {
    //     sum*=i;
    // }
    // console.log(sum);
    

// 二、简答题
// 1. 转字符串类型的时候，有哪些限制？
    // undefined和null不能转字符串
    
    // var a;
    // b=String(a)
    // c=String(null)
    // console.log(typeof(a));
    // console.log(typeof(null));

// 2. 关于变量命名的规则有哪些

    // 2.1不能使用保留字，中文
    // 2.2使用驼峰命名法

// 3. Console.log(true&&false||true)和console.log(false || true&&false)的结果分别是什么，并解释为什么

    //  3.1console.log(true&&false||true)
    //  有&先算&,true&&false结果是false
    //  然后false||true结果就是true了



    // 3.2console.log(false || true&&false)
    // 有&先算&,true&&false结果是false
    // 然后false||false结果就是false了

// 4. 将一行字符串分多行显示，有几种写法，分别是什么

    // 4.1使用转义字符 \n可以让字符串多行显示

    // console.log("1","2","1","\n","2","1","2","1","2")
    

    // 4.2使用反引号``可以让字符串多行显示
    // console.log(`
    // asdasdas
    // asdasdasd
    // sadasd
    // "as"
    // "3213123"
    // `);