[
  "obsidian-tasks-plugin",
  "table-editor-obsidian",
  "obsidian-admonition",
  "obsidian-image-auto-upload-plugin",
  "obsidian-show-file-path",
  "quickadd",
  "templater-obsidian",
  "calendar",
  "obsidian-linter",
  "code-block-copy",
  "obsidian-auto-link-title",
  "open-vscode",
  "dataview",
  "obsidian-wakatime"
]