<?php

/**
 * 1.函数概述
 * 
 * 1.1 什么是函数
 * 将重复使用的代码，起个名字，就叫”函数”。 
 * 函数可以避免代码的重复编写，对将来的维护非常方便。 
 * 每一个函数，都是一个独立的”小功能”。
 * 
 * 1.2 定义函数
 * 语法: function 函数名(){ 代码块 }
 * 
 * 1.3 函数的调用
 * 语法: 函数名();
 * 
 * 1.4 函数的参数
 * 语法: function 函数名(参数1,参数2,...) {代码块}
 * 
 * 1.5 调用带有参数的函数
 * 语法: 函数名(参数1，参数2,...);
 * 
 * 1.6 函数参数的默认值
 * 语法: function 函数名(参数1,参数2,参数3=默认值3,...) {代码块}
 * 
 * 1.7 函数的返回值
 * 语法: function 函数名(参数列表) {代码块; return 值;}
 * 
 * 
 */


//  和 js 一样


function fn1(){};
fn1();


?>