// 28. 在数组中 查询数据第二次55出现的位置,打印第二次出现的索引（索引指从0开始）[11, 32,55, 47,55, 79,23]


var arr = [11, 32, 55, 47, 55, 79, 23];
var b = 0;//统计第二个55出现的下标
var conut = 0;//累计55出现的次数


for (var i = 0; i < arr.length; i++) {
    if (arr[i] == 55) {//循环碰到数组里面的55一次就把下标的值给b
        b=i;
        // conut++;
    }
}
console.log(b);

//如果不理解可以看下面的代码


for (var i = 0; i < arr.length; i++) {
    if (arr[i] == 55) {//循环碰到数组里面的55一次就把下标的值给b
        b=i;
        conut++;//累加55出现的次数
    }
}
if(conut==2)//当conut累加到2的时候就输出b
{
    console.log(b);
}



